Repository: Kephson/reint_mailtask_example
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# mail_sendout_task_h
source: Mail sendout task
de: E-Mail Versand Test Task

# mail_sendout_task_t
source: This is an example mail sendout task with FLUID templates and translation.
de: Ein Beispiel für einen Scheduler-Task mit FLUID Templates und Übersetzung.

# task_f_0
source: http-link or page id
de: http-Link oder Seiten-ID

# task_f_1
source: Language of mail sendout
de: Sprache

# task_f_2
source: Email address of receiver
de: E-Mail Adresse des Empfängers

# task_f_3
source: Name of receiver
de: Name des Empfängers

# task_f_4
source: Email address of sender
de: E-Mail Adresse des Senders

# task_f_5
source: Name of sender
de: Name des Senders

# task_f_6
source: Rootpage ID of page tree (needed if rootpage ID is not 1)
de: Rootpage ID des Seitenbaum (benötigt, wenn ID nicht 1 ist)

# task_en
source: English
de: Englisch

# task_de
source: German
de: Deutsch

# task_f_0_message_error_head
source: No link found
de: Kein Link gefunden

# task_f_0_message_error_body
source: Please enter a page id or a http-link to the link field.
de: Bitte geben Sie eine Seiten-ID oder einen http-Link in das vorgesehene Feld ein.

# task_f_2_message_error_head
source: No receiver email address found
de: Keine Empfänger Adresse gefunden

# task_f_2_message_error_body
source: Please enter an receiver email address in the receiver email field.
de: Bitte geben Sie eine E-Mail Adresse für den Empfänger an.

# task_f_3_message_error_head
source: No receiver name found
de: Kein Empfänger-Name gefunden

# task_f_3_message_error_body
source: Please enter a name for the receiver in the receiver name field.
de: Bitte geben Sie einen Namen für den Empfänger an.

# task_f_4_message_error_head
source: No sender email address found
de: Keine Sender E-Mail Adresse gefunden

# task_f_4_message_error_body
source: Please enter an receiver sender address in the sender email field.
de: Bitte geben Sie eine E-Mail Adresse für den Sender an.

# task_f_5_message_error_head
source: No sender name found
de: Kein Sender Name gefunden

# task_f_5_message_error_body
source: Please enter a name for the sender in the sender name field.
de: Bitte geben Sie einen Namen für den Sender an.

# subject
source: Testmail from TYPO3 scheduler
de: Test E-Mail vom TYPO3 Scheduler

# example_mail_title
source: Test mail
de: Test E-Mail

# example_mail_headline
source: This is a test mail
de: Dies ist eine Test E-Mail

# example_mail_text
source: This is a text as example and could be translated.
de: Dies ist ein Text als Beispiel und kann übersetzt werden.

# example_mail_footer
source: This is a text in footer.
de: Dies ist ein Text im Fußbereich.

# example_mail_link_page
source: This is an example frontend link to an internal page id.
de: Dies ist ein Frontend-Link zu einer internen Seite.

# example_mail_link_external
source: This is an example link to an external uri.
de: Dies ist ein Beispiel zu einer externen URI.
